In [6]:
import pandas as pd
import os

In [11]:
data_file = os.path.join("column_manipulation.csv")

In [12]:
data_file_pd = pd.read_csv(data_file)
data_file_pd.head()

   Membership(Days)               Name          Trainer  Weight
0                52        Gino Walker  Bettyann Savory     128
1                70       Hiedi Wasser  Mariah Barberio     180
2               148      Kerrie Wetzel   Gordon Perrine     193
3               124  Elizabeth Sackett        Pa Dargan     177
4               186        Jack Mitten  Blanch Victoria     237

In [13]:
data_file_pd.columns

Index(['Membership(Days)', 'Name', 'Trainer', 'Weight'], dtype='object')

In [14]:
renamed_df = data_file_pd.rename(columns={"Membership(Days)": "Membership"})

In [15]:
renamed_df.head()

   Membership               Name          Trainer  Weight
0          52        Gino Walker  Bettyann Savory     128
1          70       Hiedi Wasser  Mariah Barberio     180
2         148      Kerrie Wetzel   Gordon Perrine     193
3         124  Elizabeth Sackett        Pa Dargan     177
4         186        Jack Mitten  Blanch Victoria     237

In [ ]:
renamed_df.to_csv("columns.csv", encoding="utf-8", )